docs/example.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-11-14 Tue 22:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Linear regression with spike and slab prior</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="https://maxcdn.bootstrapcdn.com/bootswatch/3.3.7/cosmo/bootstrap.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Linear regression with spike and slab prior</h1>
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">import</span> edward <span class="org-keyword">as</span> ed
<span class="org-keyword">import</span> matplotlib.pyplot <span class="org-keyword">as</span> plt
<span class="org-keyword">import</span> numpy
<span class="org-keyword">import</span> nwas
<span class="org-keyword">import</span> scipy.special
<span class="org-keyword">import</span> tensorflow <span class="org-keyword">as</span> tf

<span class="org-keyword">from</span> edward.models <span class="org-keyword">import</span> *
<span class="org-keyword">from</span> nwas.models <span class="org-keyword">import</span> *
</pre>
</div>

<p>
Simulate some data:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">p</span> = 10000
<span class="org-variable-name">n_train</span> = 7500
<span class="org-variable-name">n_validate</span> = 1000
<span class="org-variable-name">pve_y</span> = 0.5

<span class="org-keyword">with</span> nwas.simulation.simulation(p, pve_y, [(100, 1)], 0) <span class="org-keyword">as</span> s:
    <span class="org-variable-name">true_w</span> = s.theta.reshape(-1, 1)
    <span class="org-variable-name">x_train</span>, <span class="org-variable-name">y_train</span> = s.sample_gaussian(n=n_train)
    <span class="org-variable-name">x_validate</span>, <span class="org-variable-name">y_validate</span> = s.sample_gaussian(n=n_validate)
    <span class="org-variable-name">x_train</span> = x_train.astype(<span class="org-string">'float32'</span>)
    <span class="org-variable-name">y_train</span> = y_train.reshape(-1, 1).astype(<span class="org-string">'float32'</span>)
    <span class="org-variable-name">x_validate</span> = x_validate.astype(<span class="org-string">'float32'</span>)
    <span class="org-variable-name">y_validate</span> = y_validate.reshape(-1, 1).astype(<span class="org-string">'float32'</span>)
</pre>
</div>

<p>
Set up the model:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">x</span> = tf.placeholder(tf.float32)
<span class="org-variable-name">logodds</span> = Normal(loc=-numpy.log(p).astype(<span class="org-string">'float32'</span>), scale=tf.ones(1))
<span class="org-variable-name">scale</span> = Normal(loc=tf.zeros([1]), scale=tf.ones([1]))
<span class="org-variable-name">w</span> = SpikeSlab(logodds=logodds,
              loc=tf.zeros([p, 1]),
              scale=scale,
)
<span class="org-comment-delimiter"># </span><span class="org-comment">This is a dummy which gets swapped out in inference. It only needs to have</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the correct shape</span>
<span class="org-variable-name">eta</span> = LocalReparameterization(ed.models.Normal(tf.matmul(x, w), 1.0))
<span class="org-variable-name">y</span> = NormalWithSoftplusScale(loc=eta, scale=tf.Variable(tf.zeros([1])))
</pre>
</div>

<p>
Set up the variational approximation:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">q_logodds</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                   scale=tf.Variable(tf.random_normal([1])))
<span class="org-variable-name">q_scale</span> = Normal(loc=tf.Variable(tf.random_normal([1])),
                 scale=tf.Variable(tf.random_normal([1])))
<span class="org-variable-name">q_w</span> = SpikeSlab(
    logodds=tf.Variable(tf.zeros([p, 1])),
    loc=tf.Variable(tf.zeros([p, 1])),
    scale=tf.Variable(tf.zeros([p, 1])))
<span class="org-variable-name">q_eta</span> = LocalReparameterization(
    ed.models.Normal(loc=tf.matmul(x, q_w.mean()),
    scale=tf.sqrt(tf.matmul(tf.square(x), q_w.variance()))))
</pre>
</div>

<p>
Fit the approximation:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">inference</span> = ed.ReparameterizationKLKLqp(
    latent_vars={
        logodds: q_logodds,
        scale: q_scale,
        w: q_w,
        eta: q_eta,
    },
    data={
        x: x_train,
        y: y_train,
    })

inference.run(n_iter=1000, optimizer=<span class="org-string">'rmsprop'</span>)
</pre>
</div>

<p>
Plot the fit:
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">session</span> = ed.get_session()
<span class="org-variable-name">pip</span> = session.run(q_w.pip)
<span class="org-variable-name">est_w</span> = session.run(q_w.mean())

plt.switch_backend(<span class="org-string">'pdf'</span>)
<span class="org-variable-name">q</span> = numpy.logical_or(pip &gt; 0.1, true_w != 0)
<span class="org-variable-name">nq</span> = numpy.count_nonzero(q)
<span class="org-variable-name">fig</span>, <span class="org-variable-name">ax</span> = plt.subplots(3, 1)
fig.set_size_inches(6, 8)
plt.xlabel(<span class="org-string">'True and false positive variants'</span>)
ax[0].bar(<span class="org-builtin">range</span>(nq), true_w[q])
ax[0].set_ylabel(<span class="org-string">'True effect size'</span>)
ax[1].bar(<span class="org-builtin">range</span>(nq), est_w[q])
ax[1].set_ylabel(<span class="org-string">'Estimated effect size'</span>)
ax[2].bar(<span class="org-builtin">range</span>(nq), pip[q])
ax[2].set_ylabel(<span class="org-string">'PIP'</span>)
plt.savefig(<span class="org-string">'example'</span>)
plt.close()
</pre>
</div>

<p>
Check the fit. We can't do this using <code>ed.copy</code> because the copied nodes remain
in the graph (unlike the way it works in Theano), so we can't feed in data of
different shapes.
</p>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">def</span> <span class="org-function-name">correlation_score</span>(y_true, y_pred):
    <span class="org-variable-name">R</span> = 1 - (tf.reduce_sum(tf.square(y_true - y_pred)) /
             tf.reduce_sum(tf.square(y_true - tf.reduce_mean(y_true))))
    <span class="org-keyword">return</span> ed.get_session().run(R)

<span class="org-keyword">print</span>(<span class="org-string">'Training set score = {:.3f}'</span>.<span class="org-builtin">format</span>(
    correlation_score(y_train, session.run(q_eta.mean(), {x: x_train}))))
<span class="org-keyword">print</span>(<span class="org-string">'Validation set score = {:.3f}'</span>.<span class="org-builtin">format</span>(
    correlation_score(y_validate, session.run(q_eta.mean(), {x: x_validate}))))
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Sarkar</p>
<p class="date">Created: 2017-11-14 Tue 22:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
